<h1><font color="blue">데이터 프레임(DataFrame)</font></h1>

<h3><font color="red">DataFrame의 생성과 속성 다루기</font></h3>

<h4><font color="green"> DataFrame 생성하기</font></h4>

<h6><font color="BlueViolet">1) DataFrame 생성</font></h6>

In [1]:
import pandas as pd

In [2]:
humans01 = pd.DataFrame({
    '이름':['김철수','박영희'],
    '직업':['의사','변호사'],
    '권역':['서울','경기'],
    '연령대':['청년','중년'],
    '성별':['남','여']
})
humans01 # 5열 2행의 데이터프레임 완성

    이름   직업  권역 연령대 성별
0  김철수   의사  서울  청년  남
1  박영희  변호사  경기  중년  여

<h6><font color="BlueViolet">2) index 매개 변수 사용하기</font></h6>

In [3]:
humans02 = pd.DataFrame({
    '직업':['의사','변호사'],
    '권역':['서울','경기'],
    '연령대':['청년','중년'],
    '성별':['남','여']},
    index=['김철수','박영희']
)
humans02 
# {} 괄호 열고 닫고를 조심해야함 / dict이기 때문에 안에 data만 {} 처리 해야함.

      직업  권역 연령대 성별
김철수   의사  서울  청년  남
박영희  변호사  경기  중년  여

In [4]:
mydata01 = {
    '성별':['남','여','남','여'],
    '나이':[10,15,20,25],
    '직업':['의사','판사','변호사','학생'],
}
myindex01 = ['김철수','유관순','이순신','황진이']

myframe01 = pd.DataFrame(mydata01, index=myindex01)
myframe01

    성별  나이   직업
김철수  남  10   의사
유관순  여  15   판사
이순신  남  20  변호사
황진이  여  25   학생

<h6><font color="BlueViolet">3) DataFrame 속성 정보</font></h6>

In [5]:
print(type(myframe01 ))

<class 'pandas.core.frame.DataFrame'>

In [6]:
myframe01.columns.name = '직원 정보'
myframe01.index.name = '직원 이름'
myframe01

직원 정보 성별  나이   직업
직원 이름
김철수    남  10   의사
유관순    여  15   판사
이순신    남  20  변호사
황진이    여  25   학생

In [7]:
print(myframe01.index)

Index(['김철수', '유관순', '이순신', '황진이'], dtype='object', name='직원 이름')

In [8]:
print(myframe01.columns)

Index(['성별', '나이', '직업'], dtype='object', name='직원 정보')

In [9]:
print(myframe01.values)
print(type(myframe01.values))

[['남' 10 '의사']
 ['여' 15 '판사']
 ['남' 20 '변호사']
 ['여' 25 '학생']]
<class 'numpy.ndarray'>

In [10]:
print(myframe01.dtypes)

직원 정보
성별    object
나이     int64
직업    object
dtype: object

In [11]:
myframe01.T

직원 이름 김철수 유관순  이순신 황진이
직원 정보
성별      남   여    남   여
나이     10  15   20  25
직업     의사  판사  변호사  학생

In [12]:
mycolumns01 = ['직업','성별','나이']
newframe = pd.DataFrame(myframe01, index=myindex01, columns=mycolumns01)
newframe

      직업 성별  나이
김철수   의사  남  10
유관순   판사  여  15
이순신  변호사  남  20
황진이   학생  여  25

<h3><font color="red">DataFrame의 읽기와 쓰기</font></h3>

<h4><font color="green"> 영업 사원 실적표 DataFrame 생성</font></h4>

In [13]:
myindex02 = ['최유식','윤선협','유관철','심형식','연규희']
mycolumns02 = ['중구','용산구','마포구','노원구','은평구']

In [14]:
mylist02 = list(10*onedata for onedata in range(1, 26))
print(mylist02)

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250]

<h4><font color="green">DataFrame 읽기</font></h4>

In [15]:
import numpy as np

In [16]:
myframe02 = pd.DataFrame(np.reshape(mylist02, (5,5)),\
                         index=myindex02 , columns=mycolumns02)
myframe02

      중구  용산구  마포구  노원구  은평구
최유식   10   20   30   40   50
윤선협   60   70   80   90  100
유관철  110  120  130  140  150
심형식  160  170  180  190  200
연규희  210  220  230  240  250

<h6><font color="BlueViolet">iloc속성 사용</font></h6>

In [17]:
result = myframe02.iloc[1] #loc = location
result

중구      60
용산구     70
마포구     80
노원구     90
은평구    100
Name: 윤선협, dtype: int32

In [18]:
result = myframe02.iloc[[1,3]]
result

      중구  용산구  마포구  노원구  은평구
윤선협   60   70   80   90  100
심형식  160  170  180  190  200

In [19]:
result = myframe02.iloc[0::2]
result

      중구  용산구  마포구  노원구  은평구
최유식   10   20   30   40   50
유관철  110  120  130  140  150
연규희  210  220  230  240  250

In [20]:
result = myframe02.loc['연규희']
result

중구     210
용산구    220
마포구    230
노원구    240
은평구    250
Name: 연규희, dtype: int32

In [21]:
result = myframe02.loc[['연규희']]
result

      중구  용산구  마포구  노원구  은평구
연규희  210  220  230  240  250

In [22]:
result = myframe02.loc[['유관철','심형식']]
result

      중구  용산구  마포구  노원구  은평구
유관철  110  120  130  140  150
심형식  160  170  180  190  200

<h6><font color="BlueViolet">1) 복원 추출</font></h6>

In [23]:
mytarget02 = np.random.choice(myframe02.index, 3)
mytarget02

array(['연규희', '유관철', '윤선협'], dtype=object)

In [24]:
result02= myframe02.loc[mytarget02]
result02

      중구  용산구  마포구  노원구  은평구
연규희  210  220  230  240  250
유관철  110  120  130  140  150
윤선협   60   70   80   90  100

<h6><font color="BlueViolet">2) 행과 열 동시에 추출하기</font></h6>

In [25]:
result02 = myframe02.loc[['유관철'],['노원구']]
result02

     노원구
유관철  140

In [26]:
result02 = myframe02.loc[['연규희','심형식'],['용산구','마포구']]
result02

     용산구  마포구
연규희  220  230
심형식  170  180

<h6><font color="BlueViolet">3) 관계 연산을 이용한 Boolean indexing</font></h6>

In [27]:
bollTest = [False, True, True, False, True]
pd.DataFrame(bollTest)

       0
0  False
1   True
2   True
3  False
4   True

In [28]:
result02 = myframe02.loc[bollTest]
result02

      중구  용산구  마포구  노원구  은평구
윤선협   60   70   80   90  100
유관철  110  120  130  140  150
연규희  210  220  230  240  250

In [29]:
gu = '중구'
su = 70

result02 = myframe02.loc[myframe02[gu] <= su]
result02

     중구  용산구  마포구  노원구  은평구
최유식  10   20   30   40   50
윤선협  60   70   80   90  100

In [30]:
# 노원구 실적이 140인 항목들
gu = '노원구'
su = 140

result02 = myframe02.loc[myframe02[gu] == su]
result02

      중구  용산구  마포구  노원구  은평구
유관철  110  120  130  140  150

<h6><font color="BlueViolet">4) 다중 관계 연산 사용</font></h6>

In [31]:
# 용산구 >= 70 & 노원구 >= 140
cond01 = myframe02['용산구'] >= 70 
cond01

최유식    False
윤선협     True
유관철     True
심형식     True
연규희     True
Name: 용산구, dtype: bool

In [32]:
cond02 =myframe02['노원구'] >= 140
cond02

최유식    False
윤선협    False
유관철     True
심형식     True
연규희     True
Name: 노원구, dtype: bool

In [33]:
df02 = pd.DataFrame([cond01],[cond02])
df02.T

노원구  False  False  True   True   True
최유식  False  False  False  False  False
윤선협   True   True   True   True   True
유관철   True   True   True   True   True
심형식   True   True   True   True   True
연규희   True   True   True   True   True

In [34]:
df02.all()

최유식    False
윤선협     True
유관철     True
심형식     True
연규희     True
dtype: bool

In [35]:
df02.any()

최유식    False
윤선협     True
유관철     True
심형식     True
연규희     True
dtype: bool

In [36]:
result02 = myframe02.loc[df02.all()]
result02

      중구  용산구  마포구  노원구  은평구
윤선협   60   70   80   90  100
유관철  110  120  130  140  150
심형식  160  170  180  190  200
연규희  210  220  230  240  250

In [37]:
result02 = myframe02.loc[df02.any()]
result02

      중구  용산구  마포구  노원구  은평구
윤선협   60   70   80   90  100
유관철  110  120  130  140  150
심형식  160  170  180  190  200
연규희  210  220  230  240  250

<h6><font color="BlueViolet">5) 람다 함수 사용</font></h6>

In [38]:
result02 = myframe02.loc[lambda df02 : df02['마포구'] >= 130]
result02

      중구  용산구  마포구  노원구  은평구
유관철  110  120  130  140  150
심형식  160  170  180  190  200
연규희  210  220  230  240  250

<h4><font color="green"> -----------------------------------------------------------------------------------------------------</font></h4>

<h4><font color="green"> -----------------------------------------------------------------------------------------------------</font></h4>

<h4><font color="green"> DataFrame에 쓰기</font></h4>

In [39]:
myframe02.loc[['윤선협','연규희'],['용산구']] = 30 
myframe02

      중구  용산구  마포구  노원구  은평구
최유식   10   20   30   40   50
윤선협   60   30   80   90  100
유관철  110  120  130  140  150
심형식  160  170  180  190  200
연규희  210   30  230  240  250

In [40]:
myframe02.loc['최유식':'심형식',['노원구']] = 80 
myframe02

      중구  용산구  마포구  노원구  은평구
최유식   10   20   30   80   50
윤선협   60   30   80   80  100
유관철  110  120  130   80  150
심형식  160  170  180   80  200
연규희  210   30  230  240  250

In [41]:
myframe02.loc[['연규희'], :] = 50 
myframe02

      중구  용산구  마포구  노원구  은평구
최유식   10   20   30   80   50
윤선협   60   30   80   80  100
유관철  110  120  130   80  150
심형식  160  170  180   80  200
연규희   50   50   50   50   50

In [42]:
myframe02.loc[:,['은평구']] = 60 
myframe02

      중구  용산구  마포구  노원구  은평구
최유식   10   20   30   80   60
윤선협   60   30   80   80   60
유관철  110  120  130   80   60
심형식  160  170  180   80   60
연규희   50   50   50   50   60

In [43]:
myframe02.loc[myframe02['노원구'] <= 70 , ['노원구','은평구']] = 0 
myframe02

      중구  용산구  마포구  노원구  은평구
최유식   10   20   30   80   60
윤선협   60   30   80   80   60
유관철  110  120  130   80   60
심형식  160  170  180   80   60
연규희   50   50   50    0    0

<h3><font color="red">DataFrame의 산술 연산</font></h3>

<h4><font color="green"> DataFrame 생성하기</font></h4>

In [45]:
myindex31 = ['강유성','안동철','신호진']
mylist31 = [60,30,50]
myseries31 = pd.Series(data=mylist31, index=myindex31)
myseries31.to_frame()

      0
강유성  60
안동철  30
신호진  50

In [44]:
myindex31 = ['강유성','안동철','이지성']
mycolumns31 = ['용산구','마포구','서대문구']

mylist31 = list(10*onedata for onedata in range(1, 10))
myframe31 = pd.DataFrame(np.reshape(mylist31, (3,3)),\
                         index=myindex31 , columns=mycolumns31)
myframe31

     용산구  마포구  서대문구
강유성   10   20    30
안동철   40   50    60
이지성   70   80    90

<h6><font color="BlueViolet">1) Series와 DataFrame의 산술 연산</font></h6>

In [47]:
result31 = myframe31.add(myseries31, axis=0)
result31

      용산구   마포구  서대문구
강유성  70.0  80.0  90.0
신호진   NaN   NaN   NaN
안동철  70.0  80.0  90.0
이지성   NaN   NaN   NaN

<h6><font color="BlueViolet">2) DataFrame과 DataFrame의 산술 연산</font></h6>

In [48]:
myindex32 = ['강유성','안동철','정유미']
mycolumns32 = ['용산구','마포구','구로구']

mylist32 = list(5*onedata for onedata in range(1, 10))
myframe32 = pd.DataFrame(np.reshape(mylist32, (3,3)),\
                         index=myindex32 , columns=mycolumns32)
myframe32

     용산구  마포구  구로구
강유성    5   10   15
안동철   20   25   30
정유미   35   40   45

In [50]:
result31 = myframe31.add(myframe32, fill_value=0)
result31

      구로구   마포구  서대문구   용산구
강유성  15.0  30.0  30.0  15.0
안동철  30.0  75.0  60.0  60.0
이지성   NaN  80.0  90.0  70.0
정유미  45.0  40.0   NaN  35.0

<h4><font color="green"> -----------------------------------------------------------------------------------------------------</font></h4>